import numpy as np

# 输入比较矩阵
array = np.array([[1, 2, 7, 5, 5],
                  [1 / 2, 1, 4, 3, 3],
                  [1 / 7, 1 / 4, 1, 1 / 2, 1 / 3],
                  [1 / 5, 1 / 3, 2, 1, 1],
                  [1 / 5, 1 / 3, 3, 1, 1]])

# 一致性指标RI表（层次分析法很少有大于10个指标，如果超过10则建立二级指标体系）
n_ri = np.array([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
                [0, 0, 0.52, 0.89, 1.12, 1.26, 1.36, 1.41, 1.46, 1.49, 1.52, 1.54, 1.56, 1.58, 1.59])

# 给出对象数目
n = array.shape[0]
# 给出矩阵特征值
eigenvalue = np.linalg.eig(array)[0]
print(eigenvalue)
